zhouxiyu1997/friendmaker/firmware/esp32/src/classic_bt_controller_transport.cpp
  if (hasPeerAddress_) {
    output.print("INFO bt_last_peer=");
    output.println(formatBluetoothAddress(lastPeerAddress_));
  }
}

const char *ClassicBtControllerTransport::name() const { return CONTROL_TRANSPORT; }

bool ClassicBtControllerTransport::isHidReportChannelOpen() const {
  return connected_ && appRegistered_ && hidReady_;
}

bool ClassicBtControllerTransport::isControllerInputReady() const {
  return isHidReportChannelOpen() && paired_;
}

bool ClassicBtControllerTransport::sendCurrentInputReport(bool logFailure, bool waitForSendEvent) {
  readyForReports_ = waitForSendEvent ? isControllerInputReady() : isHidReportChannelOpen();

  if (!readyForReports_) {
    if (logFailure) {
      Serial.printf(
          "WARN bt report skipped reason=%s connected=%s paired=%s\n",
          waitForSendEvent && !paired_ ? "not-paired" : "not-ready",
          boolName(connected_),
          boolName(paired_));
    }
    return false;
  }

  updateInputReport();

  const bool shouldSendFullReport = connected_ || paired_;
  const uint8_t *payload = shouldSendFullReport ? report30_ : dummyReport_;
  const size_t payloadLength = shouldSendFullReport ? sizeof(report30_) : sizeof(dummyReport_);
  const uint32_t expectedEventCount = inputReportSendEventCount_ + 1;

  const esp_err_t err = esp_bt_hid_device_send_report(
      ESP_HIDD_REPORT_TYPE_INTRDATA,
      0x30,
      payloadLength,
      const_cast<uint8_t *>(payload));
  if (err != ESP_OK) {
    sendReportFailureCount_ += 1;
    lastSendReportStatus_ = static_cast<int>(err);
    lastSendReportReason_ = 0;
    lastSendReportId_ = 0x30;
    readyForReports_ = isHidReportChannelOpen();
    if (logFailure) {
      Serial.printf(
          "WARN bt send_report failed err=%s connected=%s fail_count=%lu\n",
          esp_err_to_name(err),
          boolName(connected_),
          static_cast<unsigned long>(sendReportFailureCount_));
    }
    return false;
  }

  timer_ = static_cast<uint8_t>(timer_ + 1);
  return waitForSendEvent ? waitForInputReportAccepted(expectedEventCount, logFailure) : true;
}

bool ClassicBtControllerTransport::waitForInputReportAccepted(
    uint32_t expectedEventCount, bool logFailure) {
  const uint32_t startedAt = millis();

  while (inputReportSendEventCount_ < expectedEventCount) {
    if (millis() - startedAt >= HID_SEND_REPORT_TIMEOUT_MS) {
      if (logFailure) {
        Serial.printf(
            "WARN bt send_report timeout report=48 waited_ms=%u\n",
            HID_SEND_REPORT_TIMEOUT_MS);
      }
      return false;
    }
    delay(1);
  }

  if (lastSendReportStatus_ != ESP_HIDD_SUCCESS || lastSendReportId_ != 0x30) {
    if (logFailure) {
      Serial.printf(
          "WARN bt send_report rejected status=%d reason=%u report=%u\n",
          lastSendReportStatus_,
          lastSendReportReason_,
          lastSendReportId_);
    }
    return false;
  }

  return true;
}

bool ClassicBtControllerTransport::repeatCurrentInputReport(
    uint16_t durationMs, bool logFailure) {
  const uint32_t startedAt = millis();

  while (true) {
    if (!sendCurrentInputReport(logFailure, true)) {
      return false;
    }

    const uint32_t elapsed = millis() - startedAt;
    if (elapsed >= durationMs) {
      break;
    }

    const uint32_t remaining = durationMs - elapsed;
    delay(remaining < HID_REPEAT_INTERVAL_MS ? remaining : HID_REPEAT_INTERVAL_MS);
  }

  return true;
}

bool ClassicBtControllerTransport::sendSubcommandReply(
    uint8_t reportId, const uint8_t *data, size_t length, const char *label) {
  readyForReports_ = isHidReportChannelOpen();

  if (!readyForReports_) {
    Serial.printf("WARN bt reply skipped reason=not-ready label=%s\n", label);
    return false;
  }

  const esp_err_t err = esp_bt_hid_device_send_report(
      ESP_HIDD_REPORT_TYPE_INTRDATA,
      reportId,
      length,
      const_cast<uint8_t *>(data));
  if (err != ESP_OK) {
    sendReportFailureCount_ += 1;
    lastSendReportStatus_ = static_cast<int>(err);
    lastSendReportReason_ = 0;
    lastSendReportId_ = reportId;
    readyForReports_ = isHidReportChannelOpen();
    Serial.printf(
        "WARN bt reply failed label=%s err=%s fail_count=%lu\n",
        label,
        esp_err_to_name(err),
        static_cast<unsigned long>(sendReportFailureCount_));
    return false;
  }

  Serial.printf("INFO bt reply label=%s report=%u len=%u\n", label, reportId, length);
  return true;
}

bool ClassicBtControllerTransport::attemptVirtualCablePlug(
    const uint8_t peerAddress[6], const char *reason) {
  if (!appRegistered_ || !hidReady_ || connected_) {
    return false;
  }

  const esp_err_t err = esp_bt_hid_device_connect(const_cast<uint8_t *>(peerAddress));
  if (err != ESP_OK) {
    Serial.printf(
        "WARN bt virtual-cable reason=%s err=%s peer=%s\n",
        reason,
        esp_err_to_name(err),
        formatBluetoothAddress(peerAddress).c_str());
    return false;
  }

  Serial.printf(
      "INFO bt virtual-cable reason=%s peer=%s\n",
      reason,
      formatBluetoothAddress(peerAddress).c_str());
  return true;
}

void ClassicBtControllerTransport::processIncomingReport(uint8_t reportId, uint16_t len, uint8_t *data) {
  if (len < 12 || data == nullptr) {
    const bool repeated = ignoredReportCount_ > 0 && lastIgnoredReportId_ == reportId &&
                          lastIgnoredReportLen_ == len;
    ignoredReportCount_ += 1;
    lastIgnoredReportId_ = reportId;
    lastIgnoredReportLen_ = len;
    if (!repeated || ignoredReportCount_ <= 5 || (ignoredReportCount_ % 20) == 0) {
      Serial.printf(
          "INFO bt intr ignored report=%u len=%u count=%lu\n",
          reportId,
          len,
          static_cast<unsigned long>(ignoredReportCount_));
    }
    return;
  }

  Serial.printf(
      "INFO bt intr report=%u len=%u subcmd=%u arg0=%u arg1=%u\n",
      reportId,
      len,
      data[9],
      data[10],
      data[11]);

  if (data[9] == 2) {
    sendSubcommandReply(0x21, kReply02, sizeof(kReply02), "reply02");
    return;
  }
  if (data[9] == 8) {
    sendSubcommandReply(0x21, kReply08, sizeof(kReply08), "reply08");
    return;
  }
  if (data[9] == 16 && data[10] == 0 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress0, sizeof(kReplySpiAddress0), "replyspi0");
    return;
  }
  if (data[9] == 16 && data[10] == 80 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress50, sizeof(kReplySpiAddress50), "replyspi50");
    return;
  }
  if (data[9] == 3) {
    sendSubcommandReply(0x21, kReply03, sizeof(kReply03), "reply03");
    return;
  }
  if (data[9] == 4) {
    sendSubcommandReply(0x21, kReply04, sizeof(kReply04), "reply04");
    return;
  }
  if (data[9] == 16 && data[10] == 128 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress80, sizeof(kReplySpiAddress80), "replyspi80");
    return;
  }
  if (data[9] == 16 && data[10] == 152 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress98, sizeof(kReplySpiAddress98), "replyspi98");
    return;
  }
  if (data[9] == 16 && data[10] == 16 && data[11] == 128) {
    sendSubcommandReply(0x21, kReplySpiAddress10, sizeof(kReplySpiAddress10), "replyspi10");
    return;
  }
  if (data[9] == 16 && data[10] == 61 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress3D, sizeof(kReplySpiAddress3D), "replyspi3d");
    return;
  }
  if (data[9] == 16 && data[10] == 32 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress20, sizeof(kReplySpiAddress20), "replyspi20");
    return;
  }
  if (data[9] == 64) {
    sendSubcommandReply(0x21, kReply4001, sizeof(kReply4001), "reply4001");
    return;
  }
  if (data[9] == 72) {
    sendSubcommandReply(0x21, kReply4801, sizeof(kReply4801), "reply4801");
    return;
  }
  if (data[9] == 34) {
    sendSubcommandReply(0x21, kReply3401, sizeof(kReply3401), "reply3401");
    return;
  }
  if (data[9] == 48) {
    paired_ = true;
    pairingComplete_ = true;
    sendSubcommandReply(0x21, kReply3001, sizeof(kReply3001), "reply3001");
    return;
  }
  if (data[9] == 33 && data[10] == 33) {
    paired_ = true;
    pairingComplete_ = true;
    sendSubcommandReply(0x21, kReply3333, sizeof(kReply3333), "reply3333");
    return;
  }
}

void ClassicBtControllerTransport::handleGapEvent(int event, void *rawParam) {
  const auto gapEvent = static_cast<esp_bt_gap_cb_event_t>(event);
  auto *param = reinterpret_cast<esp_bt_gap_cb_param_t *>(rawParam);

